roberthardesty/spell-word/sdkconfig.defaults
# Spell-Word — IDF defaults.
#
# Anything that *must* be set for correct firmware operation lives here.
# Per-developer experiments belong in `sdkconfig` (gitignored).

# --- Target ------------------------------------------------------------------
CONFIG_IDF_TARGET="esp32s3"
CONFIG_IDF_TARGET_ESP32S3=y

# --- Flash + PSRAM (N16R8 DevKitC-1) -----------------------------------------
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"

CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
# Threshold above which heap_caps_malloc(MALLOC_CAP_DEFAULT) goes to PSRAM.
# We use explicit MALLOC_CAP_SPIRAM/INTERNAL flags everywhere that matters,
# so this just affects incidental allocations.
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384

# --- Partition table --------------------------------------------------------
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_CUSTOM_APP_BIN_OFFSET=0x10000

# --- CPU clock --------------------------------------------------------------
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=240

# --- Watchdog ---------------------------------------------------------------
# Critical: a TFLM Invoke() takes ~250 ms, which would trip the per-CPU IDLE
# task watchdog on Core 1 since the inference task runs there at priority 5.
# Disabling the Core-1 IDLE check lets Invoke() run uninterrupted. The Core-0
# IDLE check stays on. Lesson carried over from the EARS POC.
CONFIG_ESP_TASK_WDT_INIT=y
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU0=y
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU1=n
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10

# --- FreeRTOS ---------------------------------------------------------------
# Dual-core scheduler — capture on Core 0, inference on Core 1.
CONFIG_FREERTOS_UNICORE=n
# 1 kHz tick = 1 ms granularity for vTaskDelay/pdMS_TO_TICKS.
CONFIG_FREERTOS_HZ=1000

# --- Logging ----------------------------------------------------------------
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_DEFAULT_LEVEL=3
CONFIG_LOG_MAXIMUM_LEVEL=4

# --- Compiler ---------------------------------------------------------------
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_COMPILER_CXX_EXCEPTIONS=n
CONFIG_COMPILER_CXX_RTTI=n
